GetOrderedParameters Method
 Gets the parameters associated to the element in order.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public IList<Parameter> GetOrderedParameters()
  Visual Basic
Public Function GetOrderedParameters As IList(Of Parameter)
  Visual C++
public:
IList<Parameter^>^ GetOrderedParameters()
 Return Value
 A collection containing all parameters.
 Remarks
 The collection consists of only visible parameters associated to the element; it returns a different list than Element.Parameters.
 The parameters are returned in the order in which they appear in the Revit UI within a given group; however, parameters of different groups may be mixed within this output.
 Currently the Revit UI order is determined first by group and next by the order of the individual parameters.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →